from dataclasses import dataclass

main_menu = 'Добро пожаловать в бота по <b>созданию и проведению розыгрышей</b>\nВыберите действие кнопками ниже ⬇️'
view_giveaway = 'Выберите <b>розыгрыш</b> для просмотра'
no_giveaways = '📭 А тут пустовато... Создадим первый розыгрыш? ➕'


@dataclass
class CreateGiveaway:
    name = 'Отправьте <b>название</b> нового розыгрыша\n\n<i>Для корректного отображения в кнопках — от 8 до 16 символов, с эмодзи</i>'
    prize = 'Продолжаем. Отправьте <b>разыгрываемые призы</b>\n\n<code>1. Приз за первое место\n2. Приз за второе место\n3. Приз за третье место...</code>\n<i>Пожалуйста, следуйте формату указанному выше (количество мест неограниченно)</i>'
    description = 'Следующий шаг — <b>описание</b> розыгрыша\n\n<i>До одного полного сообщения телеграмм. Как минимум укажите условия для участия</i>'
    channel_username = 'Теперь отправьте <b>юзернейм</b> тгк/чата, на который должны подписываться участники и их друзья\n\n<i>Не забудьте добавить этот бот в администраторы канала/чата</i>'
    bot_not_admin = 'Бот <b>не является</b> администратором в ТГК @*, пожалуйста, <i>добавьте его и отправьте юзернейм заново</i>'
    referral_amount = 'Теперь отправьте <b>количество друзей</b>, которое человек должен привести в бота и в канал\n\n<i>Значение по умолчанию — 3</i>'
    end_date = 'Последнее — отправьте <b>количество дней</b>, через которых победитель определится автоматически\n\n<i>Пропустите, если победителя будете выбирать вы</i>'
