expire = [
    "хранен",  # хранение, хранить
    "температур",  # температура, температурный
    "срок",  # срок хранения, срок годности
    "годн",  # годность, годен
    "дата",  # дата изготовления, дата производства
    "открыт",  # после открытия
    "упаков"  # упаковка, упакован
]

use = [
    "примен",  # применение, применять
    "использ",  # использовать, использование
    "дозиров",  # дозировка, дозировать
    "курс",  # курс лечения
    "инструкц",  # инструкция
    "способ",  # способ применения
    "капл",  # капли, капать
    "таблет",  # таблетки
    "спрей",  # спрей
]
