banned_in_channel = '<b>Вы были забанены в чате @peptide_rus</b>, свяжитесь с администрацией если считаете, что это ошибка'
verify_phone = "Уважаемый *, для подтверждения, что вы не робот, нажмите кнопку ниже ⬇️"
offer = '<b>Публичная оферта</b> магазина'
greetings = '''<b>👋🏻 ElixirPeptide приветствует тебя, full_name!</b>

Здесь ты можешь:
 — Пообщаться с нашим <b>ИИ-Экспертом</b> и получить совет,
 — Сделать <b>точные расчёты</b> и строить <b>графики содержания</b> препарата в крови в удобном калькуляторе,
 — Купить <b>нужные препараты</b> в нашем Telegram-магазине,
 — Оставить свой <b>анонимный отзыв</b> по нашим товарам и услугам.

Выбери нужный инструмент <u>кнопками ниже</u> 👇🏻'''

about = """<b>ИП</b>: ХАКИМОВ РУСЛАН РАЛИФОВИЧ
<b>Юридический адрес:</b> 450150 Республика Башкортостан, г. Уфа, улица Набережная р. Уфы, 39, корп. 1, кв. 87
<b>Почтовый адрес:</b> 450150 Республика Башкортостан, г. Уфа, улица Набережная р. Уфы, 39, корп. 1, кв. 87
<b>ИНН:</b> 027614099149
<b>ОГРНИП:</b> 323028000061111

<b>Телефон:</b> +7 961 038 79 77
<b>Электронная почта:</b> elixirpeptide@yandex.ru"""

banned_until = "Уважаемый name, вы <b>заблокированы</b> за недобросовестное использование нашего продукта.\n\nБлокировка до date, при вопросах напишите в поддержку: @ShostakovIV"
new_chat = 'Новый чат успешно начат, продолжайте общение'

pick_ai = '''<b>Перед вами два ИИ-эксперта <u>ElixirPeptide</u></b> — <i>выберите своего</i>:

<b>🆓 Бесплатный ИИ-ассистент</b>
<i>Для быстрых, понятных ответов:</i> простые вопросы, базовые схемы, расчёты и повседневные задачи ⚡️

✨ <b>Премиум ИИ-эксперт</b>
<i>Для тех, кому нужно больше:</i>
— <b>глубже разбирается</b> в запросе  
— опирается на <b>расширенные знания</b> по пептидам  
— <b>аккуратно считает</b> и анализирует  
— <b>лучше помнит контекст</b> диалога  
— даёт <b>более точные</b> и <b>уверенные рекомендации</b> 💎🧠

Каждый месяц вам доступно <b><u>2 бесплатных премиум-запроса</u></b>.  
Чтобы пользоваться <b>премиум-режимом без ограничений</b>, достаточно оформлять заказы от <b>5 000 ₽</b> в месяц.
'''
premium_limit_0 = """<b>😢 Сожалеем, вы исчерпали лимит премиум запросов</b>✨

Каждый месяц вам доступно <i>2 бесплатных премиум-запроса.</i> Чтобы пользоваться 💎премиум-режимом без ограничений, достаточно <u>оформлять заказы от 5 000 ₽ в месяц</u> 🛍️.
"""
pick_free = "⚡️🤖 Выбрана <b>Бесплатная модель </b>\nВы можете начать диалог, <i>отправив сообщение</i>"
pick_premium = "✨️🤖 Выбрана <b>Премиум модель 💎</b>\nВы можете начать диалог, <i>отправив сообщение</i>"
pick_fallback_free = "<b>У вас не выбрана модель нейросети</b>\nАвтоматически выбрана бесплатная"
calculators_start = (
    "<b>В нашем универсальном калькуляторе 🧮</b> вы за несколько секунд можете "
    "<b>рассчитать дозировку</b> и <b>построить наглядные графики</b> уровня препарата во времени."
    "<i>Мы убрали ручные подсчёты и путаницу</i> — бот сам всё считает и выдаёт "
    "<b>понятный, аккуратный результат</b>.\n\n"
    "📈 <b>Графики</b> показывают, как меняется <i>содержание препарата в организме</i> "
    "в зависимости от <b>дозы</b>, <b>интервала</b> и <b>периода полувыведения</b> — "
    "это удобно для <i>планирования курса</i> и <i>контроля</i>"
    "Готовы начать? Выберите нужный инструмент ниже ⬇️"
)
cartridge_volume = 'Отправьте <b>объем</b> картриджа в миллилитрах'
cartridge_unit = 'Выберите <b>единицу измерения</b> количества вещества в картридже\n\n<i>1мг = 1000мкг, 1мкг = 0.001мг</i>'
cartridge_amount = 'Отлично, теперь отправьте <b>количество вещества в картридже в миллиграммах</b> <i>(только цифры)</i>'

water_volume = 'Отправьте <b>объем растворителя</b> (воды) в миллилитрах'
vial_unit = 'Выберите <b>единицу измерения</b> количества вещества в флаконе\n\n<i>1мг = 1000мкг, 1мкг = 0.001мг</i>'
vial_amount = 'Отправьте <b>количество вещества в флаконе в миллиграммах</b> <i>(только цифры)</i>'

desired_dosage_unit = 'Выберите <b>единицу измерения</b> желаемой дозировки вещества\n\n<i>1мг = 1000мкг, 1мкг = 0.001мг</i>'
desired_dosage = 'Остался последний шаг!\nОтправьте <b>желаемую дозировку вещества</b> в миллиграммах <i>(только цифры)</i>'

dosage_unit = desired_dosage_unit.replace('желаемой ', '')
dosage = desired_dosage.replace('желаемую ', '').replace('Остался последний шаг!\n', '')
choose_peptide = 'Выберите <b>пептид из перечисленных ниже</b> ⬇️'
course_length_weeks = 'Отправьте <b>продолжительность курса</b> в неделях <i>(только цифры)</i>'
course_interval_days = 'Отправьте <b>интервал между уколами</b> в днях <i>(только цифры, можно отправлять дробные числа как 0.25 = 6 часов и т.д.)</i>'

num_format_error = 'Ошибка: <b>некорректный формат числа</b>\n<i>Повторите заново</i>'

