banned_in_channel = '<b>Вы были забанены в чате @peptide_rus</b>, свяжитесь с поддержкой (@ShostakovIV) если считаете, что это ошибка'
verify_phone = "Уважаемый *, для подтверждения, что Вы не робот, нажмите кнопку ниже ⬇️"
offer = '<b>Публичная оферта</b> магазина'
greetings = '''<b>👋🏻 ElixirPeptide приветствует Вас, full_name!</b>

Здесь Вы можете:
 — Пообщаться с нашим <b>ИИ-профессором</b> и получить совет,
 — Сделать <b>точные расчёты</b> и строить <b>графики содержания</b> препарата в крови в удобном калькуляторе,
 — Купить <b>нужные препараты</b> в нашем Telegram-магазине,

Выберите нужный инструмент <u>кнопками ниже</u> 👇🏻'''

about = """ОсОО «ДЕТАЛУМ»
ИНН 01508202410079
Кыргызская Республика, ОШ, г. Ош, Ош, ОШ АЙТИЕВА Б-Н +996 999 034204
1240020001788846"""

banned_until = "Уважаемый name, Вы <b>заблокированы</b> за недобросовестное использование нашего продукта.\n\nБлокировка до date, при вопросах напишите в поддержку: @ShostakovIV"
new_chat = 'Новый чат успешно начат, продолжайте общение'

pick_ai = '''<b>Перед вами два ИИ-режима <u>ElixirPeptide</u></b> — <i>выберите своего</i>:

<b>🤖 ИИ-эксперт</b>
<i>Для быстрых и понятных ответов:</i> простые вопросы, базовые схемы, расчёты и повседневные задачи ⚡️

💎 <b>ИИ-профессор</b>
<i>Для тех, кому нужно больше:</i>
— <b>глубже разбирается</b> в запросе  
— опирается на <b>расширенные знания</b> по пептидам  
— <b>аккуратно считает</b> и анализирует  
— лучше помнит контекст диалога  
— даёт <b>более точные</b> и <b>уверенные рекомендации</b> 🧠

Каждый месяц вам доступно <b><u>2 запроса к Профессору</u></b>.  
Чтобы увеличить лимит, достаточно оформлять заказы от <b>5 000 ₽</b> в месяц 🛍️.
'''
premium_limit_0 = """<b>😢 Сожалеем, Вы исчерпали лимит запросов к Профессору</b> 💎

Каждый месяц вам доступно <i>2 запроса к Профессору.</i> Чтобы увеличить лимит, достаточно <u>оформлять заказы от 5 000 ₽ в месяц</u> 🛍️.
"""

pick_free = "⚡️🤖 Выбран <b>ИИ-эксперт</b>\nВы можете начать диалог, <i>отправив сообщение</i>"
pick_premium = "💎🤖 Выбран <b>ИИ-профессор</b>\nВы можете начать диалог, <i>отправив сообщение</i>"
pick_fallback_free = "<b>У вас не выбран ИИ-режим</b>\nАвтоматически выбран <b>ИИ-эксперт</b>"
calculators_start = (
    "<b>В нашем универсальном калькуляторе 🧮</b> Вы за несколько секунд можете "
    "<b>рассчитать дозировку</b> и <b>построить наглядные графики</b> уровня препарата во времени."
    "<i>Мы убрали ручные подсчёты и путаницу</i> — бот сам всё считает и выдаёт "
    "<b>понятный, аккуратный результат</b>.\n\n"
    "📈 <b>Графики</b> показывают, как меняется <i>содержание препарата в организме</i> "
    "в зависимости от <b>дозы</b>, <b>интервала</b> и <b>периода полувыведения</b> — "
    "это удобно для <i>планирования курса</i> и <i>контроля</i>"
    "Готовы начать? Выберите нужный инструмент ниже ⬇️"
)
cartridge_volume = 'Отправьте <b>объем</b> картриджа в миллилитрах'
cartridge_unit = 'Выберите <b>единицу измерения</b> количества вещества в картридже\n\n<i>1мг = 1000мкг, 1мкг = 0.001мг</i>'
cartridge_amount = 'Отлично, теперь отправьте <b>количество вещества в картридже в миллиграммах</b> <i>(только цифры)</i>'

water_volume = 'Отправьте <b>объем растворителя</b> (воды) в миллилитрах'
vial_unit = 'Выберите <b>единицу измерения</b> количества вещества в флаконе\n\n<i>1мг = 1000мкг, 1мкг = 0.001мг</i>'
vial_amount = 'Отправьте <b>количество вещества в флаконе в миллиграммах</b> <i>(только цифры)</i>'

desired_dosage_unit = 'Выберите <b>единицу измерения</b> желаемой дозировки вещества\n\n<i>1мг = 1000мкг, 1мкг = 0.001мг</i>'
desired_dosage = 'Остался последний шаг!\nОтправьте <b>желаемую дозировку вещества</b> в миллиграммах <i>(только цифры)</i>'

dosage_unit = desired_dosage_unit.replace('желаемой ', '')
dosage = desired_dosage.replace('желаемую ', '').replace('Остался последний шаг!\n', '')
choose_peptide = 'Выберите <b>пептид из перечисленных ниже</b> ⬇️'
course_length_weeks = 'Отправьте <b>продолжительность курса</b> в неделях <i>(только цифры)</i>'
course_interval_days = 'Отправьте <b>интервал между уколами</b> в днях <i>(только цифры, можно отправлять дробные числа как 0.25 = 6 часов и т.д.)</i>'

num_format_error = 'Ошибка: <b>некорректный формат числа</b>\n<i>Повторите заново</i>'
blockquote = """

**2 поток: «Пептиды в современной медицине: от биохимии до клинического применения»**
"""

