banned_in_channel = '<b>Вы были забанены в чате @peptide_rus</b>, свяжитесь с администрацией если считаете, что это ошибка'
verify_phone = "Уважаемый *, для подтверждения, что вы не робот, нажмите кнопку ниже ⬇️"
offer = '<b>Публичная оферта</b> магазина'
greetings = '''<b>👋🏻 ElixirPeptide приветствует тебя, full_name!</b>

Здесь ты можешь:
 — Пообщаться с нашим <b>ИИ-Экспертом</b> и получить совет,
 — Сделать <b>точные расчёты</b> и строить <b>графики содержания</b> препарата в крови в удобном калькуляторе,
 — Купить <b>нужные препараты</b> в нашем Telegram-магазине,
 — Оставить свой <b>анонимный отзыв</b> по нашим товарам и услугам.

Выбери нужный инструмент <u>кнопками ниже</u> 👇🏻'''

about = """<b>ИП</b>: ХАКИМОВ РУСЛАН РАЛИФОВИЧ
<b>Юридический адрес:</b> 450150 Республика Башкортостан, г. Уфа, улица Набережная р. Уфы, 39, корп. 1, кв. 87
<b>Почтовый адрес:</b> 450150 Республика Башкортостан, г. Уфа, улица Набережная р. Уфы, 39, корп. 1, кв. 87
<b>ИНН:</b> 027614099149
<b>ОГРНИП:</b> 323028000061111

<b>Телефон:</b> +7 961 038 79 77
<b>Электронная почта:</b> elixirpeptide@yandex.ru"""

banned_until = "Уважаемый name, вы <b>заблокированы</b> за недобросовестное использование нашего продукта.\n\nБлокировка до date, при вопросах напишите в поддержку: @ShostakovIV"
new_chat = 'Новый чат успешно начат, продолжайте общение'

pick_ai = '''<b>Бесплатная (4.1-mini)</b> — ⚡️быстрые ответы для простых вопросов и базовых расчётов

✨ <b>Премиум (4.1) — максимум качества:</b> глубже понимает запрос, точнее считает, лучше держит контекст и даёт более сильные рекомендации 💎🧠'''
